* sid information
  sid is stored in page, it dose get set in a script tag however i have no idea where it is comming from
  - window.utag_data
  - booking.env.b_sid

* urls
** istanbul fri,Dec28- Mon Dec31 2 adults 0 children
   - https://www.booking.com/searchresults.en-us.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID&sid=0f1b27e2213e03597d627f2373a9316d&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID%3Bsid%3D0f1b27e2213e03597d627f2373a9316d%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul&is_ski_area=0&ssne=Istanbul&ssne_untouched=Istanbul&dest_id=-755070&dest_type=city&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1
   - https://www.booking.com/searchresults.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID;sid=95f6bfe9d4fbc69be4318916750090f0;ac_click_type=b&ac_position=0&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&class_interval=1&dest_id=-755070&dest_type=city&dtdisc=0&from_sf=1&group_adults=2&group_children=0&iata=IST&inac=0&index_postcard=0&label_click=undef&no_rooms=1&offset=0&postcard=0&raw_dest_type=city&room1=A%2CA&sb_price_type=total&search_selected=1&shw_aparth=1&slp_r_match=0&src=index&src_elem=sb&ss=Istanbul%2C%20Marmara%20Region%2C%20Turkey&ss_all=0&ss_raw=Istanbul%2C&ssb=empty&sshis=0&
   - https://www.booking.com/searchresults.en-us.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID&sid=896e917ee6ad11a0fa8ff1910074fe12&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID%3Bsid%3D896e917ee6ad11a0fa8ff1910074fe12%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul%2C+Marmara+Region%2C+Turkey&is_ski_area=&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1&ss_raw=ista&ac_position=0&ac_langcode=en&ac_click_type=b&dest_id=-755070&dest_type=city&iata=IST&place_id_lat=41.008171&place_id_lon=28.974446&search_pageview_id=f405398eb0c60060&search_selected=true&search_pageview_id=f405398eb0c60060&ac_suggestion_list_length=5&ac_suggestion_theme_list_length=0
   - https://www.booking.com/searchresults.en-us.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID&sid=2bf8ccc064c6ecdb89acd4ede6d39ad6&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID%3Bsid%3D2bf8ccc064c6ecdb89acd4ede6d39ad6%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul%2C+Marmara+Region%2C+Turkey&is_ski_area=&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1&ss_raw=is&ac_position=0&ac_langcode=en&ac_click_type=b&dest_id=-755070&dest_type=city&iata=IST&place_id_lat=41.008171&place_id_lon=28.974446&search_pageview_id=c8de39a017a002ef&search_selected=true&search_pageview_id=c8de39a017a002ef&ac_suggestion_list_length=5&ac_suggestion_theme_list_length=0
   - https://www.booking.com/searchresults.en-us.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID&sid=6613cfb4376f102c1df2bcc77a5a0386&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID%3Bsid%3D6613cfb4376f102c1df2bcc77a5a0386%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul%2C+Marmara+Region%2C+Turkey&is_ski_area=&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1&ss_raw=ist&ac_position=0&ac_langcode=en&ac_click_type=b&dest_id=-755070&dest_type=city&iata=IST&place_id_lat=41.008171&place_id_lon=28.974446&search_pageview_id=de8c39bf0677006e&search_selected=true&search_pageview_id=de8c39bf0677006e&ac_suggestion_list_length=5&ac_suggestion_theme_list_length=0
   - https://www.booking.com/searchresults.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID;sid=dd9d81f85ce0c1a0ca562eae783b18f5;ac_click_type=b&ac_position=0&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&class_interval=1&dest_id=-755070&dest_type=city&dtdisc=0&from_sf=1&group_adults=2&group_children=0&iata=IST&inac=0&index_postcard=0&label_click=undef&no_rooms=1&offset=0&postcard=0&raw_dest_type=city&room1=A%2CA&sb_price_type=total&search_selected=1&shw_aparth=1&slp_r_match=0&src=index&src_elem=sb&ss=Istanbul%2C%20Marmara%20Region%2C%20Turkey&ss_all=0&ss_raw=ista&ssb=empty&sshis=0&
   - https://www.booking.com/searchresults.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID;sid=69abf7331718b2cb2332a2c16e12aad3;ac_click_type=b&ac_position=0&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&class_interval=1&dest_id=-755070&dest_type=city&dtdisc=0&from_sf=1&group_adults=2&group_children=0&iata=IST&inac=0&index_postcard=0&label_click=undef&no_rooms=1&offset=0&postcard=0&raw_dest_type=city&room1=A%2CA&sb_price_type=total&search_selected=1&shw_aparth=1&slp_r_match=0&src=index&src_elem=sb&ss=Istanbul%2C%20Marmara%20Region%2C%20Turkey&ss_all=0&ss_raw=I&ssb=empty&sshis=0&
   - https://www.booking.com/searchresults.en-us.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID&sid=6ac57063c26e09fe676963980b8b95e8&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID%3Bsid%3D6ac57063c26e09fe676963980b8b95e8%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul%2C+Marmara+Region%2C+Turkey&is_ski_area=&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1&ss_raw=ist&ac_position=0&ac_langcode=en&ac_click_type=b&dest_id=-755070&dest_type=city&iata=IST&place_id_lat=41.008171&place_id_lon=28.974446&search_pageview_id=f5153a1def4f0140&search_selected=true&search_pageview_id=f5153a1def4f0140&ac_suggestion_list_length=5&ac_suggestion_theme_list_length=0
   - https://www.booking.com/searchresults.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID;sid=bfa7afb453e471a00890cb03b88596d3;ac_click_type=b&ac_position=0&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&class_interval=1&dest_id=-755070&dest_type=city&dtdisc=0&from_sf=1&group_adults=2&group_children=0&iata=IST&inac=0&index_postcard=0&label_click=undef&no_rooms=1&offset=0&postcard=0&raw_dest_type=city&room1=A%2CA&sb_price_type=total&search_selected=1&shw_aparth=1&slp_r_match=0&src=index&src_elem=sb&ss=Istanbul%2C%20Marmara%20Region%2C%20Turkey&ss_all=0&ss_raw=is&ssb=empty&sshis=0&
** istanbul fri,Dec28- Mon Dec31 2 adults 0 children lowest price first
   - https://www.booking.com/searchresults.en-us.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID&sid=e21ae0d81de12f771b98f6092c7b8573&tmpl=searchresults&ac_click_type=b&ac_position=0&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&class_interval=1&dest_id=-755070&dest_type=city&dtdisc=0&from_sf=1&group_adults=2&group_children=0&iata=IST&inac=0&index_postcard=0&label_click=undef&no_rooms=1&postcard=0&raw_dest_type=city&room1=A%2CA&sb_price_type=total&search_selected=1&shw_aparth=1&slp_r_match=0&src_elem=sb&ss=Istanbul%2C%20Marmara%20Region%2C%20Turkey&ss_all=0&ss_raw=i&ssb=empty&sshis=0&order=price
   - https://www.booking.com/searchresults.html?label=gen173nr-1FCAEoggI46AdIM1gEaKcCiAEBmAExuAEXyAEM2AEB6AEB-AECiAIBqAID&sid=e095a03ee8a794d4e971021143ef4976&ac_click_type=b&ac_position=0&checkin_month=12&checkin_monthday=28&checkin_year=2018&checkout_month=12&checkout_monthday=31&checkout_year=2018&class_interval=1&dest_id=-755070&dest_type=city&from_sf=1&group_adults=2&group_children=0&iata=IST&label_click=undef&no_rooms=1&raw_dest_type=city&room1=A%2CA&sb_price_type=total&search_selected=1&shw_aparth=1&slp_r_match=0&src_elem=sb&srpvid=99093aa5461100ca&ss=Istanbul%2C%20Marmara%20Region%2C%20Turkey&ss_raw=i&ssb=empty&order=price
* validity check
** one
   :LOGBOOK:
   CLOCK: [2019-02-01 Fri 14:00]--[2019-02-01 Fri 14:00] =>  0:00
   CLOCK: [2019-02-01 Fri 04:54]--[2019-02-01 Fri 09:58] =>  5:04
   CLOCK: [2019-02-01 Fri 03:54]--[2019-02-01 Fri 04:54] =>  1:00
   CLOCK: [2019-02-01 Fri 02:53]--[2019-02-01 Fri 03:54] =>  1:01
   CLOCK: [2019-01-31 Thu 13:33]--[2019-02-01 Fri 02:53] => 13:20
   CLOCK: [2019-01-31 Thu 08:18]--[2019-01-31 Thu 13:33] =>  5:15
   CLOCK: [2019-01-31 Thu 04:49]--[2019-01-31 Thu 08:18] =>  3:29
   CLOCK: [2019-01-31 Thu 03:30]--[2019-01-31 Thu 04:49] =>  1:19
   :END:
   - curl "https://www.booking.com/searchresults.en-us.html?label=gen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgM^&sid=0f1b27e2213e03597d627f2373a9316d^&sb=1^&src=index^&src_elem=sb^&error_url=https^%^3A^%^2F^%^2Fwww.booking.com^%^2Findex.html^%^3Flabel^%^3Dgen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgM^%^3Bsid^%^3D0f1b27e2213e03597d627f2373a9316d^%^3Bsb_price_type^%^3Dtotal^%^26^%^3B^&ss=Istanbul^&is_ski_area=0^&ssne=Istanbul^&ssne_untouched=Istanbul^&dest_id=-755070^&dest_type=city^&checkin_month=1^&checkin_monthday=31^&checkin_year=2019^&checkout_month=2^&checkout_monthday=3^&checkout_year=2019^&no_rooms=1^&group_adults=2^&group_children=0^&b_h4u_keep_filters=^&from_sf=1" -H "authority: www.booking.com" -H "upgrade-insecure-requests: 1" -H "user-agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36" -H "accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8" -H "referer: https://www.booking.com/" -H "accept-encoding: gzip, deflate, br" -H "accept-language: en-US,en;q=0.9" -H "cookie: cors_js=1; _gcl_au=1.1.38458775.1544902406; _ga=GA1.2.372227484.1544902407; zz_cook_tms_seg1=1; zz_cook_tms_ed=1; cto_lwid=739d9ce2-7cd0-47c1-acc4-26e33f3075e1; _tq_id.TV-451827-1.3b4c=e77a107d2689d895.1544904869.0.1546367440..; header_signin_prompt=1; _gid=GA1.2.1087340901.1548788751; BJS=-; zz_cook_tms_seg3=5; zz_cook_tms_hlist=3538902; cws=true; _tq_id.TV-634572-1.3b4c=7141920206274933.1548795848.0.1548875825..; has_preloaded=1; _gat=1; utag_main=v_id:0167b35bfea500780d2b4e15f5b003073001806b00bd0^$_sn:13^$_ss:0^$_st:1548936374386^$4split:1^$4split2:2^$ses_id:1548934532381^%^3Bexp-session^$_pn:2^%^3Bexp-session; bkng=11UmFuZG9tSVYkc2RlIyh9YfDNyGw8J7nzPnUG3Pr^%^2Bfv5ISwgIdFKxFXY3vovk4FY5H7QIQviMmBHT7TVdMgF4TmvlGkZicEumkhJh2QjcsmD4huUl0fc08dG^%^2Bl3GAZhGTT9G^%^2BJ2te1YGW8q8udmwkRhmQPSDiFjZo8QrbNEkAyFzoBiG7vtiLb2cCI95E^%^2F7v2MNlrJ90PbGtyS^%^2B^%^2Be4VMUnA^%^3D^%^3D; lastSeen=0" --compressed
     

curl 'https://www.booking.com/searchresults.en-us.html?label=gen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB&sid=0f1b27e2213e03597d627f2373a9316d&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB%3Bsid%3D0f1b27e2213e03597d627f2373a9316d%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul&is_ski_area=0&ssne=Istanbul&ssne_untouched=Istanbul&dest_id=-755070&dest_type=city&checkin_year=&checkin_month=&checkout_year=&checkout_month=&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1' 
-H 'authority: www.booking.com' 
-H 'cache-control: max-age=0' 
-H 'upgrade-insecure-requests: 1' 
-H 'user-agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36' 
-H 'accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8' 
-H 'referer: https://www.booking.com/' 
-H 'accept-encoding: gzip, deflate, br' 
-H 'accept-language: en-US,en;q=0.9' 
-H 'cookie: cors_js=1; _ga=GA1.2.372227484.1544902407; zz_cook_tms_seg1=1; zz_cook_tms_ed=1; cto_lwid=739d9ce2-7cd0-47c1-acc4-26e33f3075e1; cws=true; _tq_id.TV-634572-1.3b4c=7141920206274933.1548795848.0.1548875825..; header_signin_prompt=1; _gid=GA1.2.1818941729.1552743939; BJS=-; _gcl_au=1.1.196723670.1552743941; zz_cook_tms_seg3=5; _tq_id.TV-451827-1.3b4c=e77a107d2689d895.1544904869.0.1552743954..; has_preloaded=1; _gat=1; utag_main=v_id:0167b35bfea500780d2b4e15f5b003073001806b00bd0$_sn:15$_ss:1$_st:1552751500008$4split:1$4split2:2$ses_id:1552749700008%3Bexp-session$_pn:1%3Bexp-session; bkng=11UmFuZG9tSVYkc2RlIyh9YfDNyGw8J7nzPnUG3Pr%2Bfv5iyz1NtopREMniKfQ2ifWhPYT%2FPM9fKeLDM3Hoh8OKg%2BwzzKI8nJ0wmliCbtb82iaGHV5kaI89R2xxGO4EK6OS3Dp%2Bf2m8fYEXTWoqtUPY0yERfZQkVcTMDdJ9hkTtwJr6p7mfw4pEFPEudDx%2FywO4y5H0aztOJ8u6AyNExiTwxA%3D%3D; lastSeen=1552749706089'
 --compressed


curl 'https://www.booking.com/searchresults.en-us.html?label=gen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB&sid=0f1b27e2213e03597d627f2373a9316d&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB%3Bsid%3D0f1b27e2213e03597d627f2373a9316d%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul&is_ski_area=0&ssne=Istanbul&ssne_untouched=Istanbul&dest_id=-755070&dest_type=city&checkin_year=&checkin_month=&checkout_year=&checkout_month=&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1' -H 'authority: www.booking.com' -H 'cache-control: max-age=0' -H 'upgrade-insecure-requests: 1' -H 'user-agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36' -H 'accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8' -H 'referer: https://www.booking.com/' -H 'accept-encoding: gzip, deflate, br' -H 'accept-language: en-US,en;q=0.9' -H 'cookie: cors_js=1; _ga=GA1.2.372227484.1544902407; zz_cook_tms_seg1=1; zz_cook_tms_ed=1; cto_lwid=739d9ce2-7cd0-47c1-acc4-26e33f3075e1; cws=true; _tq_id.TV-634572-1.3b4c=7141920206274933.1548795848.0.1548875825..; header_signin_prompt=1; _gid=GA1.2.1818941729.1552743939; BJS=-; _gcl_au=1.1.196723670.1552743941; zz_cook_tms_seg3=5; _tq_id.TV-451827-1.3b4c=e77a107d2689d895.1544904869.0.1552743954..; has_preloaded=1; lastSeen=0; utag_main=v_id:0167b35bfea500780d2b4e15f5b003073001806b00bd0$_sn:15$_ss:0$_st:1552751528023$4split:1$4split2:2$ses_id:1552749700008%3Bexp-session$_pn:2%3Bexp-session; bkng=11UmFuZG9tSVYkc2RlIyh9YfDNyGw8J7nzPnUG3Pr%2Bfv6cshT1P7jGFBH6%2BilCgQT6HSbArw15XhxtWwb7tvvu%2FlyIubZdOmpSSLzodPUK3cGDt3XNNbD4C2Zt%2F%2BbBGCIFUkk%2BjfeCjwCF87UnTd%2FOPIUe%2BVtZViEVYpZAEroJIELNWKg990NUy7%2FFqv%2BoHlRDh3qw2%2FHeXN1reBZSWCz%2Bsw%3D%3D' --compressed
curl 'https://www.booking.com/searchresults.en-us.html?label=gen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB&sid=0f1b27e2213e03597d627f2373a9316d&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB%3Bsid%3D0f1b27e2213e03597d627f2373a9316d%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul&is_ski_area=0&ssne=Istanbul&ssne_untouched=Istanbul&dest_id=-755070&dest_type=city&checkin_year=2019&checkin_month=4&checkin_monthday=17&checkout_year=2019&checkout_month=4&checkout_monthday=26&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1' -H 'authority: www.booking.com' -H 'upgrade-insecure-requests: 1' -H 'user-agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36' -H 'accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8' -H 'referer: https://www.booking.com/' -H 'accept-encoding: gzip, deflate, br' -H 'accept-language: en-US,en;q=0.9' -H 'cookie: cors_js=1; _ga=GA1.2.372227484.1544902407; zz_cook_tms_seg1=1; zz_cook_tms_ed=1; cto_lwid=739d9ce2-7cd0-47c1-acc4-26e33f3075e1; cws=true; _tq_id.TV-634572-1.3b4c=7141920206274933.1548795848.0.1548875825..; header_signin_prompt=1; _gid=GA1.2.1818941729.1552743939; BJS=-; _gcl_au=1.1.196723670.1552743941; zz_cook_tms_seg3=5; _tq_id.TV-451827-1.3b4c=e77a107d2689d895.1544904869.0.1552743954..; has_preloaded=1; _gat=1; utag_main=v_id:0167b35bfea500780d2b4e15f5b003073001806b00bd0$_sn:15$_ss:0$_st:1552752113340$4split:1$4split2:2$ses_id:1552749700008%3Bexp-session$_pn:4%3Bexp-session; bkng=11UmFuZG9tSVYkc2RlIyh9YfDNyGw8J7nzPnUG3Pr%2Bfv4Gh4Wbk608RcEy8vB%2FtGq8l15UWP6L%2BQOscdoGdCaES9veKyrtEa%2Foc0bbfI8Ew9N7a5wuUJ34xEvDAmkCYWQxOBjmc%2FXClLBSvumfy4qs%2BfZhh9Yt%2FVrV4hx2h%2BwJF9bVzmhiSOArupDRrPDfHXD4aJfS6Qlpxsnko4i4wAajJA%3D%3D; lastSeen=0' --compressed
curl 'https://www.booking.com/searchresults.en-us.html?label=gen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB&sid=0f1b27e2213e03597d627f2373a9316d&sb=1&src=index&src_elem=sb&error_url=https%3A%2F%2Fwww.booking.com%2Findex.html%3Flabel%3Dgen173nr-1DCAEoggI46AdIM1gEaG-IAQGYATG4ARfIAQzYAQPoAQH4AQKIAgGoAgO4AoCptOQFwAIB%3Bsid%3D0f1b27e2213e03597d627f2373a9316d%3Bsb_price_type%3Dtotal%26%3B&ss=Istanbul&is_ski_area=0&ssne=Istanbul&ssne_untouched=Istanbul&dest_id=-755070&dest_type=city&checkin_year=2019&checkin_month=4&checkin_monthday=17&checkout_year=2019&checkout_month=4&checkout_monthday=26&no_rooms=1&group_adults=2&group_children=0&b_h4u_keep_filters=&from_sf=1' -H 'Connection: keep-alive' -H 'Cache-Control: max-age=0' -H 'Upgrade-Insecure-Requests: 1' -H 'User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36' -H 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8' -H 'Referer: https://www.booking.com/' -H 'Accept-Encoding: gzip, deflate, br' -H 'Accept-Language: en-US,en;q=0.9' -H 'Cookie: cors_js=1; _ga=GA1.2.372227484.1544902407; zz_cook_tms_seg1=1; zz_cook_tms_ed=1; cto_lwid=739d9ce2-7cd0-47c1-acc4-26e33f3075e1; cws=true; _tq_id.TV-634572-1.3b4c=7141920206274933.1548795848.0.1548875825..; header_signin_prompt=1; _gid=GA1.2.1818941729.1552743939; BJS=-; _gcl_au=1.1.196723670.1552743941; zz_cook_tms_seg3=5; _tq_id.TV-451827-1.3b4c=e77a107d2689d895.1544904869.0.1552743954..; has_preloaded=1; vpmss=1; zz_cook_tms_hlist=48714; utag_main=v_id:0167b35bfea500780d2b4e15f5b003073001806b00bd0$_sn:15$_ss:0$_st:1552753536992$4split:1$4split2:2$ses_id:1552749700008%3Bexp-session$_pn:8%3Bexp-session; bkng=11UmFuZG9tSVYkc2RlIyh9YfDNyGw8J7nzPnUG3Pr%2Bfv6cshT1P7jGFBH6%2BilCgQT6HSbArw15Xhyt2kHwKiBrevVeXe8kO83iBeizl2VyuDxS0IQTxmJYTqfg1HG3Oa6x47LsbS7YEAs7WmD49eFBYEqOG7LxfvaQDqo%2BthIVvi4NLu3jAY1KQBKtnIbD1RVmYCGYfwRqe9nkNanhbJ5cYw%3D%3D; lastSeen=0' --compressed

curl 'https://www.booking.com/hotel/tr/polatdemir.html' -H 'authority: www.booking.com' -H 'cache-control: max-age=0' -H 'upgrade-insecure-requests: 1' -H 'user-agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36' -H 'accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8' -H 'accept-encoding: gzip, deflate, br' -H 'accept-language: en-US,en;q=0.9' -H 'cookie: cors_js=1; _ga=GA1.2.372227484.1544902407; zz_cook_tms_seg1=1; zz_cook_tms_ed=1; cto_lwid=739d9ce2-7cd0-47c1-acc4-26e33f3075e1; cws=true; _tq_id.TV-634572-1.3b4c=7141920206274933.1548795848.0.1548875825..; header_signin_prompt=1; _gid=GA1.2.1818941729.1552743939; BJS=-; _gcl_au=1.1.196723670.1552743941; zz_cook_tms_seg3=5; _tq_id.TV-451827-1.3b4c=e77a107d2689d895.1544904869.0.1552743954..; has_preloaded=1; vpmss=1; _gat=1; zz_cook_tms_hlist=48714; utag_main=v_id:0167b35bfea500780d2b4e15f5b003073001806b00bd0$_sn:15$_ss:0$_st:1552753500481$4split:1$4split2:2$ses_id:1552749700008%3Bexp-session$_pn:7%3Bexp-session; bkng=11UmFuZG9tSVYkc2RlIyh9YfDNyGw8J7nzPnUG3Pr%2Bfv7PNBuFBems7YWklCbg9vdjQjU8KOs3JLAuvSJXItBnNbuzTlW7U5lXReQXAv9i73IQ51DdMM6SUA3JqZ56VIGldBS84b0N5yWvkD9JTPiHHiw8DKcuqY3jaG2pbQ5vVyt7mOaLm8KfFwAzeCyD6eJHb03K0lkTwnKjoU5CuOEjbQ%3D%3D; lastSeen=1552751707097' --compressed
